output/ignite-a-6-1000Mbps-3ms-10000-5000-4-run-1.out
[11:29:05][INFO ][Thread-5] Start Ignite client node.
[11:29:05][INFO ][Thread-5] 

>>>    __________  ________________  
>>>   /  _/ ___/ |/ /  _/_  __/ __/  
>>>  _/ // (7 7    // /  / / / _/    
>>> /___/\___/_/|_/___/ /_/ /___/   
>>> 
>>> ver. 2.7.0#20181130-sha1:256ae401
>>> 2018 Copyright(C) Apache Software Foundation
>>> 
>>> Ignite documentation: http://ignite.apache.org

[11:29:05][INFO ][Thread-5] Config URL: n/a
[11:29:05][INFO ][Thread-5] IgniteConfiguration [igniteInstanceName=YCSB client node, pubPoolSize=12, svcPoolSize=12, callbackPoolSize=12, stripedPoolSize=12, sysPoolSize=12, mgmtPoolSize=4, igfsPoolSize=12, dataStreamerPoolSize=12, utilityCachePoolSize=12, utilityCacheKeepAliveTime=60000, p2pPoolSize=2, qryPoolSize=12, igniteHome=null, igniteWorkDir=/tmp/ignite/work, mbeanSrv=com.sun.jmx.mbeanserver.JmxMBeanServer@710726a3, nodeId=e3fff0d5-9eaa-401c-8ede-b7cc402aa2b3, marsh=BinaryMarshaller [], marshLocJobs=false, daemon=false, p2pEnabled=false, netTimeout=2000, sndRetryDelay=1000, sndRetryCnt=3, metricsHistSize=10000, metricsUpdateFreq=2000, metricsExpTime=9223372036854775807, discoSpi=TcpDiscoverySpi [addrRslvr=null, sockTimeout=0, ackTimeout=0, marsh=null, reconCnt=10, reconDelay=2000, maxAckTimeout=600000, forceSrvMode=false, clientReconnectDisabled=false, internalLsnr=null], segPlc=STOP, segResolveAttempts=2, waitForSegOnStart=true, allResolversPassReq=true, segChkFreq=10000, commSpi=TcpCommunicationSpi [connectGate=null, connPlc=org.apache.ignite.spi.communication.tcp.TcpCommunicationSpi$FirstConnectionPolicy@2dc72d08, enableForcibleNodeKill=false, enableTroubleshootingLog=false, locAddr=null, locHost=null, locPort=47100, locPortRange=100, shmemPort=-1, directBuf=true, directSndBuf=false, idleConnTimeout=600000, connTimeout=5000, maxConnTimeout=600000, reconCnt=10, sockSndBuf=32768, sockRcvBuf=32768, msgQueueLimit=0, slowClientQueueLimit=0, nioSrvr=null, shmemSrv=null, usePairedConnections=false, connectionsPerNode=1, tcpNoDelay=true, filterReachableAddresses=false, ackSndThreshold=32, unackedMsgsBufSize=0, sockWriteTimeout=2000, boundTcpPort=-1, boundTcpShmemPort=-1, selectorsCnt=6, selectorSpins=0, addrRslvr=null, ctxInitLatch=java.util.concurrent.CountDownLatch@6140ca7[Count = 1], stopping=false], evtSpi=org.apache.ignite.spi.eventstorage.NoopEventStorageSpi@764fdacc, colSpi=NoopCollisionSpi [], deploySpi=LocalDeploymentSpi [], indexingSpi=org.apache.ignite.spi.indexing.noop.NoopIndexingSpi@3f079762, addrRslvr=null, encryptionSpi=org.apache.ignite.spi.encryption.noop.NoopEncryptionSpi@7798da11, clientMode=true, rebalanceThreadPoolSize=1, txCfg=TransactionConfiguration [txSerEnabled=false, dfltIsolation=REPEATABLE_READ, dfltConcurrency=PESSIMISTIC, dfltTxTimeout=0, txTimeoutOnPartitionMapExchange=0, pessimisticTxLogSize=0, pessimisticTxLogLinger=10000, tmLookupClsName=null, txManagerFactory=null, useJtaSync=false], cacheSanityCheckEnabled=true, discoStartupDelay=60000, deployMode=SHARED, p2pMissedCacheSize=100, locHost=null, timeSrvPortBase=31100, timeSrvPortRange=100, failureDetectionTimeout=10000, sysWorkerBlockedTimeout=null, clientFailureDetectionTimeout=30000, metricsLogFreq=60000, hadoopCfg=null, connectorCfg=ConnectorConfiguration [jettyPath=null, host=null, port=11211, noDelay=true, directBuf=false, sndBufSize=32768, rcvBufSize=32768, idleQryCurTimeout=600000, idleQryCurCheckFreq=60000, sndQueueLimit=0, selectorCnt=4, idleTimeout=7000, sslEnabled=false, sslClientAuth=false, sslCtxFactory=null, sslFactory=null, portRange=100, threadPoolSize=12, msgInterceptor=null], odbcCfg=null, warmupClos=null, atomicCfg=AtomicConfiguration [seqReserveSize=1000, cacheMode=PARTITIONED, backups=1, aff=null, grpName=null], classLdr=null, sslCtxFactory=null, platformCfg=null, binaryCfg=null, memCfg=null, pstCfg=null, dsCfg=null, activeOnStart=true, autoActivation=true, longQryWarnTimeout=3000, sqlConnCfg=null, cliConnCfg=ClientConnectorConfiguration [host=null, port=10800, portRange=100, sockSndBufSize=0, sockRcvBufSize=0, tcpNoDelay=true, maxOpenCursorsPerConn=128, threadPoolSize=12, idleTimeout=0, jdbcEnabled=true, odbcEnabled=true, thinCliEnabled=true, sslEnabled=false, useIgniteSslCtxFactory=true, sslClientAuth=false, sslCtxFactory=null], mvccVacuumThreadCnt=2, mvccVacuumFreq=5000, authEnabled=false, failureHnd=null, commFailureRslvr=null]
[11:29:05][INFO ][Thread-5] Daemon mode: off
[11:29:05][INFO ][Thread-5] OS: Linux 4.9.0-11-amd64 amd64
[11:29:05][INFO ][Thread-5] OS user: root
[11:29:05][INFO ][Thread-5] PID: 132
[11:29:05][INFO ][Thread-5] Language runtime: Java Platform API Specification ver. 1.8
[11:29:05][INFO ][Thread-5] VM information: OpenJDK Runtime Environment 1.8.0_282-b08 Oracle Corporation OpenJDK 64-Bit Server VM 25.282-b08
[11:29:05][INFO ][Thread-5] VM total memory: 14.0GB
[11:29:05][INFO ][Thread-5] Remote Management [restart: off, REST: off, JMX (remote: off)]
[11:29:05][INFO ][Thread-5] Logger: Log4J2Logger [quiet=false, config=file:/opt/ycsb-0.17.0/ignite-binding/lib/ignite-binding-0.17.0.jar!/log4j2.xml]
[11:29:05][INFO ][Thread-5] IGNITE_HOME=null
[11:29:05][INFO ][Thread-5] VM arguments: []
[11:29:05][INFO ][Thread-5] Configured caches [in 'sysMemPlc' dataRegion: ['ignite-sys-cache']]
[11:29:05][WARN ][Thread-5] Please set system property '-Djava.net.preferIPv4Stack=true' to avoid possible problems in mixed environments.
[11:29:05][INFO ][Thread-5] Configured plugins:
[11:29:05][INFO ][Thread-5]   ^-- None
[11:29:05][INFO ][Thread-5] 
[11:29:05][INFO ][Thread-5] Configured failure handler: [hnd=StopNodeOrHaltFailureHandler [tryStop=false, timeout=0, super=AbstractFailureHandler [ignoredFailureTypes=[SYSTEM_WORKER_BLOCKED]]]]
[11:29:05][INFO ][Thread-5] Successfully bound communication NIO server to TCP port [port=47100, locHost=0.0.0.0/0.0.0.0, selectorsCnt=6, selectorSpins=0, pairedConn=false]
[11:29:05][WARN ][Thread-5] Message queue limit is set to 0 which may lead to potential OOMEs when running cache operations in FULL_ASYNC or PRIMARY_SYNC modes due to message queues growth on sender and receiver sides.
[11:29:05][WARN ][Thread-5] Checkpoints are disabled (to enable configure any GridCheckpointSpi implementation)
[11:29:05][WARN ][Thread-5] Collision resolution is disabled (all jobs will be activated upon arrival).
[11:29:05][INFO ][Thread-5] Security status [authentication=off, tls/ssl=off]
[11:29:06][INFO ][Thread-5] Evict partition permits=3
[11:29:06][INFO ][Thread-5] Client connector processor has started on TCP port 10800
[11:29:06][INFO ][Thread-5] REST protocols do not start on client node. To start the protocols on client node set '-DIGNITE_REST_START_ON_CLIENT=true' system property.
[11:29:06][INFO ][Thread-5] Non-loopback local IPs: 192.168.64.4
[11:29:06][INFO ][Thread-5] Enabled local MACs: 0242C0A84004
[11:29:06][INFO ][disco-notifier-worker-#46%YCSB client node%] Assigned mvcc coordinator [crd=MvccCoordinator [nodeId=0e605c13-e229-4d5d-96f1-91babd9dfe01, crdVer=1613993213531, topVer=AffinityTopologyVersion [topVer=9, minorTopVer=0]], crdNode=TcpDiscoveryNode [id=0e605c13-e229-4d5d-96f1-91babd9dfe01, addrs=[127.0.0.1, 192.168.64.6], sockAddrs=[/127.0.0.1:47500, f3b575daad20/192.168.64.6:47500], discPort=47500, order=1, intOrder=1, lastExchangeTime=1613993346758, loc=false, ver=2.7.0#20181130-sha1:256ae401, isClient=false]]
[11:29:06][INFO ][exchange-worker-#48%YCSB client node%] Started exchange init [topVer=AffinityTopologyVersion [topVer=9, minorTopVer=0], mvccCrd=MvccCoordinator [nodeId=0e605c13-e229-4d5d-96f1-91babd9dfe01, crdVer=1613993213531, topVer=AffinityTopologyVersion [topVer=9, minorTopVer=0]], mvccCrdChange=true, crd=false, evt=NODE_JOINED, evtNode=e3fff0d5-9eaa-401c-8ede-b7cc402aa2b3, customEvt=null, allowMerge=true]
[11:29:06][INFO ][exchange-worker-#48%YCSB client node%] Components activation performed in 0 ms.
[11:29:07][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=ignite-sys-cache, id=-2100569601, memoryPolicyName=sysMemPlc, mode=REPLICATED, atomicity=TRANSACTIONAL, backups=2147483647, mvcc=false], encryptionEnabled=false]
[11:29:07][INFO ][exchange-worker-#48%YCSB client node%] Starting caches on local join performed in 253 ms.
[11:29:07][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.64.4:34092, rmtAddr=f3b575daad20/192.168.64.6:47100]
[11:29:07][INFO ][exchange-worker-#48%YCSB client node%] Sending Single Message performed in 27 ms.
[11:29:07][INFO ][exchange-worker-#48%YCSB client node%] Finished exchange init [topVer=AffinityTopologyVersion [topVer=9, minorTopVer=0], crd=false]
[11:29:07][INFO ][sys-#49%YCSB client node%] Received full message, will finish exchange [node=0e605c13-e229-4d5d-96f1-91babd9dfe01, resVer=AffinityTopologyVersion [topVer=9, minorTopVer=0]]
[11:29:07][INFO ][sys-#49%YCSB client node%] Affinity initialization on local join performed in 9 ms.
[11:29:07][INFO ][sys-#49%YCSB client node%] Affinity changes applied in 9 ms.
[11:29:07][INFO ][sys-#49%YCSB client node%] Full map updating for 2 groups performed in 2 ms.
[11:29:07][INFO ][sys-#49%YCSB client node%] Finish exchange future [startVer=AffinityTopologyVersion [topVer=9, minorTopVer=0], resVer=AffinityTopologyVersion [topVer=9, minorTopVer=0], err=null]
[11:29:07][INFO ][sys-#49%YCSB client node%] Finish proxy initialization, cacheName=ignite-sys-cache, localNodeId=e3fff0d5-9eaa-401c-8ede-b7cc402aa2b3
[11:29:07][INFO ][sys-#49%YCSB client node%] Completed partition exchange [localNode=e3fff0d5-9eaa-401c-8ede-b7cc402aa2b3, exchange=GridDhtPartitionsExchangeFuture [topVer=AffinityTopologyVersion [topVer=9, minorTopVer=0], evt=NODE_JOINED, evtNode=TcpDiscoveryNode [id=e3fff0d5-9eaa-401c-8ede-b7cc402aa2b3, addrs=[127.0.0.1, 192.168.64.4], sockAddrs=[3067f068a6ca/192.168.64.4:0, /127.0.0.1:0], discPort=0, order=9, intOrder=0, lastExchangeTime=1613993346647, loc=true, ver=2.7.0#20181130-sha1:256ae401, isClient=true], done=true], topVer=AffinityTopologyVersion [topVer=9, minorTopVer=0], durationFromInit=395]
[11:29:07][INFO ][exchange-worker-#48%YCSB client node%] Skipping rebalancing (no affinity changes) [top=AffinityTopologyVersion [topVer=9, minorTopVer=0], rebTopVer=AffinityTopologyVersion [topVer=-1, minorTopVer=0], evt=NODE_JOINED, evtNode=e3fff0d5-9eaa-401c-8ede-b7cc402aa2b3, client=true]
[11:29:07][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.64.4:57452, rmtAddr=f10d1cc4aa85/192.168.64.3:47100]
[11:29:07][INFO ][Thread-5] Performance suggestions for grid 'YCSB client node' (fix if possible)
[11:29:07][INFO ][Thread-5] To disable, set -DIGNITE_PERFORMANCE_SUGGESTIONS_DISABLED=true
[11:29:07][INFO ][Thread-5]   ^-- Enable G1 Garbage Collector (add '-XX:+UseG1GC' to JVM options)
[11:29:07][INFO ][Thread-5]   ^-- Specify JVM heap max size (add '-Xmx<size>[g|G|m|M|k|K]' to JVM options)
[11:29:07][INFO ][Thread-5]   ^-- Set max direct memory size if getting 'OOME: Direct buffer memory' (add '-XX:MaxDirectMemorySize=<size>[g|G|m|M|k|K]' to JVM options)
[11:29:07][INFO ][Thread-5]   ^-- Disable processing of calls to System.gc() (add '-XX:+DisableExplicitGC' to JVM options)
[11:29:07][INFO ][Thread-5] Refer to this page for more performance suggestions: https://apacheignite.readme.io/docs/jvm-and-system-tuning
[11:29:07][INFO ][Thread-5] 
[11:29:07][INFO ][Thread-5] To start Console Management & Monitoring run ignitevisorcmd.{sh|bat}
[11:29:07][INFO ][Thread-5] 

>>> +----------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db
>>> +----------------------------------------------------------------------+
>>> OS name: Linux 4.9.0-11-amd64 amd64
>>> CPU(s): 12
>>> Heap: 14.0GB
>>> VM name: 132@3067f068a6ca
>>> Ignite instance name: YCSB client node
>>> Local node [ID=E3FFF0D5-9EAA-401C-8EDE-B7CC402AA2B3, order=9, clientMode=true]
>>> Local node addresses: [3067f068a6ca/127.0.0.1, /192.168.64.4]
>>> Local ports: TCP:10800 TCP:47100 

[11:29:07][INFO ][Thread-5] Topology snapshot [ver=9, locNode=e3fff0d5, servers=6, clients=1, state=ACTIVE, CPUs=84, offheap=75.0GB, heap=20.0GB]
[11:29:07][INFO ][Thread-5] Activate Ignite cluster.
[11:29:07][INFO ][Thread-5] Sending activate request from node [id=e3fff0d5-9eaa-401c-8ede-b7cc402aa2b3, topVer=AffinityTopologyVersion [topVer=9, minorTopVer=0], client=true, daemon=false]
[11:29:07][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=usertable, id=358348515, memoryPolicyName=null, mode=PARTITIONED, atomicity=ATOMIC, backups=1, mvcc=false], encryptionEnabled=false]
[11:29:07][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.64.4:58494, rmtAddr=8b98da51ec2c/192.168.64.2:47100]
[11:29:07][INFO ][exchange-worker-#48%YCSB client node%] Finish proxy initialization, cacheName=usertable, localNodeId=e3fff0d5-9eaa-401c-8ede-b7cc402aa2b3
[11:29:07][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.64.4:43836, rmtAddr=44e2a0afca40/192.168.64.5:47100]
[11:29:07][INFO ][grid-nio-worker-tcp-comm-4-#36%YCSB client node%] Accepted incoming communication connection [locAddr=/192.168.64.4:47100, rmtAddr=/192.168.64.8:52284]
[11:29:07][INFO ][grid-nio-worker-tcp-comm-5-#37%YCSB client node%] Accepted incoming communication connection [locAddr=/192.168.64.4:47100, rmtAddr=/192.168.64.7:43314]
[11:29:16][WARN ][ignite-update-notifier-timer] New version is available at ignite.apache.org: 2.9.1
[11:29:22][INFO ][Thread-6] Stopped cache [cacheName=ignite-sys-cache]
[11:29:22][INFO ][Thread-6] Stopped cache [cacheName=usertable]
[11:29:22][INFO ][Thread-6] 

>>> +---------------------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db stopped OK
>>> +---------------------------------------------------------------------------------+
>>> Ignite instance name: YCSB client node
>>> Grid uptime: 00:00:14.724


[OVERALL], RunTime(ms), 16957
[OVERALL], Throughput(ops/sec), 589.7269564191779
[TOTAL_GCS_PS_Scavenge], Count, 3
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 25
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.14743173910479448
[TOTAL_GCS_PS_MarkSweep], Count, 2
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 64
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.3774252521082739
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 89
[TOTAL_GC_TIME_%], Time(%), 0.5248569912130683
[READ], Operations, 4953
[READ], AverageLatency(us), 3820.833636180093
[READ], MinLatency(us), 3342
[READ], MaxLatency(us), 219647
[READ], 95thPercentileLatency(us), 4131
[READ], 99thPercentileLatency(us), 4887
[READ], Return=OK, 4953
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 17137.75
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 68543
[CLEANUP], 95thPercentileLatency(us), 68543
[CLEANUP], 99thPercentileLatency(us), 68543
[UPDATE], Operations, 5047
[UPDATE], AverageLatency(us), 7601.989696849613
[UPDATE], MinLatency(us), 6768
[UPDATE], MaxLatency(us), 248447
[UPDATE], 95thPercentileLatency(us), 8119
[UPDATE], 99thPercentileLatency(us), 9055
[UPDATE], Return=OK, 5047